app/Controllers/Admin/Dashboard.php

SELECT *
FROM `tb_presensi_siswa`
LEFT JOIN `tb_siswa` ON `tb_presensi_siswa`.`id_siswa` = `tb_siswa`.`id_siswa`
WHERE `tb_presensi_siswa`.`tanggal` = '2025-01-21'
AND `tb_presensi_siswa`.`id_kehadiran` = '1'
---
   public function index()
   {
      $now = Time::now();

      $dateRange = [];
      $siswaKehadiranArray = [];

      for ($i = 6; $i >= 0; $i--) {
         $date = $now->subDays($i)->toDateString();
         if ($i == 0) {
            $formattedDate = "Hari ini";
         } else {
            $t = $now->subDays($i);
            $formattedDate = "{$t->getDay()} " . substr($t->toFormattedDateString(), 0, 3);
         }
         array_push($dateRange, $formattedDate);
         array_push(
            $siswaKehadiranArray,
            count($this->presensiSiswaModel
               ->join('tb_siswa', 'tb_presensi_siswa.id_siswa = tb_siswa.id_siswa', 'left')
               ->where(['tb_presensi_siswa.tanggal' => "$date", 'tb_presensi_siswa.id_kehadiran' => '1'])->findAll())
         );