app/Controllers/LoginController.php

    public function loginProcess()
    {
        if (!$this->validate([
            'username' => 'required',
            'password' => 'required'
        ])) {
            session()->setFlashdata('error', 'Semua bidang harus diisi.');
            return redirect()->back()->withInput();
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $userModel = new UserModel();
        $user = $userModel->where('username', $username)
                            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'superadmin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1