app/Models/KelasModel.php

   public function getDataKelas()
   {
      return $this->builder->orderBy('id_kelas')->get()->getResult('array');
---
SELECT *
FROM `tb_kelas`
ORDER BY `id_kelas`