app/Models/PresensiSiswaModel.php

   public function cekAbsen(string|int $id, string|Time $date)
   {
      $result = $this->where(['id_siswa' => $id, 'tanggal' => $date])->first();
---
SELECT *
FROM `tb_presensi_siswa`
WHERE `id_siswa` = '1'
AND `tanggal` = '2025-01-27'
 LIMIT 1

   public function absenMasuk(string $id,  $date, $time, $idKelas = '')
   {
      $this->save([
         'id_siswa' => $id,
         'id_kelas' => $idKelas,
         'tanggal' => $date,
         'jam_masuk' => $time,
         // 'jam_keluar' => '',
         'id_kehadiran' => Kehadiran::Hadir->value,
         'keterangan' => ''
      ]);
---
SELECT *
FROM `tb_presensi_siswa`
WHERE `id_siswa` = '44'
AND `tanggal` = '2025-01-26'
 LIMIT 1

   public function getPresensiByIdSiswaTanggal($idSiswa, $date)
   {
      return $this->where(['id_siswa' => $idSiswa, 'tanggal' => $date])->first();
---
SELECT *
FROM `tb_presensi_siswa`
WHERE `id_siswa` = '1'
AND `tanggal` = '2025-01-27'
 LIMIT 1

   public function getPresensiById(string $idPresensi)
   {
      return $this->where([$this->primaryKey => $idPresensi])->first();
---
SELECT *
FROM `tb_presensi_siswa`
WHERE `id_presensi` = '-1'
 LIMIT 1

   public function getPresensiByKelasTanggal($idKelas, $tanggal)
   {
      return $this->setTable('tb_siswa')
         ->select('*')
         ->join(
            "(SELECT id_presensi, id_siswa AS id_siswa_presensi, tanggal, jam_masuk, jam_keluar, id_kehadiran, keterangan FROM tb_presensi_siswa)tb_presensi_siswa",
            "{$this->table}.id_siswa = tb_presensi_siswa.id_siswa_presensi AND tb_presensi_siswa.tanggal = '$tanggal'",
            'left'
         )
         ->join(
            'tb_kehadiran',
            'tb_presensi_siswa.id_kehadiran = tb_kehadiran.id_kehadiran',
            'left'
         )
         ->where("{$this->table}.id_kelas = $idKelas")
         ->orderBy("nama_siswa")
         ->findAll();
---
SELECT *
FROM `tb_siswa`
LEFT JOIN (SELECT id_presensi, id_siswa AS id_siswa_presensi, tanggal, jam_masuk, jam_keluar, id_kehadiran, keterangan FROM tb_presensi_siswa)tb_presensi_siswa ON `tb_siswa`.`id_siswa` = `tb_presensi_siswa`.`id_siswa_presensi` AND `tb_presensi_siswa`.`tanggal` = '2025-01-24'
LEFT JOIN `tb_kehadiran` ON `tb_presensi_siswa`.`id_kehadiran` = `tb_kehadiran`.`id_kehadiran`
WHERE `tb_siswa`.`id_kelas` = 16
ORDER BY `nama_siswa`

         $data['jam_keluar'] = $jamKeluar;
      }

      return $this->save($data);
---
UPDATE `tb_presensi_siswa` SET `id_siswa` = '44', `id_kelas` = '18', `tanggal` = NULL, `id_kehadiran` = '1', `keterangan` = '', `jam_masuk` = '07:00:00', `jam_keluar` = '11:00:00'
WHERE `tb_presensi_siswa`.`id_presensi` IN ('34')
INSERT INTO `tb_presensi_siswa` (`id_siswa`, `id_kelas`, `tanggal`, `id_kehadiran`, `keterangan`) VALUES ('1', '1', '2025-01-27', '1', '')