app/Models/SiswaModel.php

SELECT *
FROM `tb_siswa`
LEFT JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_siswa`.`id_kelas`
ORDER BY `nama_siswa`
---
   public function getAllSiswaWithKelas($kelas = null)
   {
      $query = $this->join(
         'tb_kelas',
         'tb_kelas.id_kelas = tb_siswa.id_kelas',
         'LEFT'
      );

      if (!empty($kelas)) {
         $query = $this->where(['kelas' => $kelas]);
      } else {
         $query = $this;
      }

      return $query->orderBy('nama_siswa')->findAll();

SELECT *
FROM `tb_siswa`
LEFT JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_siswa`.`id_kelas`
WHERE `tb_siswa`.`id_kelas` = '16'
ORDER BY `nama_siswa`
---
   public function getSiswaByKelas($id_kelas)
   {
      return $this->join(
         'tb_kelas',
         'tb_kelas.id_kelas = tb_siswa.id_kelas',
         'LEFT'
      )
         ->where(['tb_siswa.id_kelas' => $id_kelas])
         ->orderBy('nama_siswa')
         ->findAll();

INSERT INTO `tb_siswa` (`nis`, `nama_siswa`, `id_kelas`, `jenis_kelamin`, `no_hp`, `unique_code`) VALUES ('3562', 'MUHAMMAD ADITYA PRASTYO', '1', 'Laki-Laki', '081331357662', '679a0a9c362828-15129602-18416355')
---
   public function importCSVItem($txtFileName, $index)
   {
      $filePath = FCPATH . 'uploads/tmp/' . $txtFileName;
      $file = fopen($filePath, 'r');
      $content = fread($file, filesize($filePath));
      $array = @unserialize($content);
      if (!empty($array)) {
         $i = 1;
         foreach ($array as $item) {
            if ($i == $index) {
               $data = array();
               $data['nis'] = getCSVInputValue($item, 'nis', 'int');
               $data['nama_siswa'] = getCSVInputValue($item, 'nama_siswa');
               $data['id_kelas'] = getCSVInputValue($item, 'id_kelas', 'int');
               $data['jenis_kelamin'] = getCSVInputValue($item, 'jenis_kelamin');
               $data['no_hp'] = getCSVInputValue($item, 'no_hp');
               $data['unique_code'] = generateToken();

               $this->insert($data);